# -*- coding: utf8 -*-

import cmath
a = input('Введите коэфициент при x^2 (пример числа: 2.0): ')
b = input('Введите коэфициент при x (пример числа: 2.0): ')
c = input('Введите свободный коэфициент (пример числа: 2.0): ')
print('================================')
print('Ваше уравнение имеет вид: {0}*x^2 + {1}*x + {2} = 0'.format(a, b, c))

d = float(b)**2 - 4*float(a)*float(c)
if d>0:
    x1 = (-float(b) + d**1/2) / (2 * float(a))
    x2 = (-float(b) - d**1/2) / (2 * float(a))
    print('================================')
    print('Дискриминант > 0, поэтому корни уравнения следующие: х1 = {0}, х2 = {1}'.format(x1, x2))

elif d == 0:
    x = (-float(b)) / (2 * float(a))
    print('================================')
    print('Дискриминант = 0, поэтому имеем следующий корень уравнения: х = {0}'.format(x))

else:
    x1 = (-float(b) + cmath.sqrt(d)) / (2 * float(a))
    x2 = (-float(b) - cmath.sqrt(d)) / (2 * float(a))
    print('================================')
    print('Дискриминант < 0, поэтому комплексные корни уравнения следующие: х1 = {0}, х2 = {1}'.format(x1, x2))
